# -*- coding: utf-8 -*-

returncodeDict = {
# 服务端系统级固定响应码
'RC8200' : {'code':8200, 'msg':'Request successful response'},
'RC990001' : {'code':990001, 'msg':'不支持的mime请求类型'},
'RC990002' : {'code':990002, 'msg':'请求contentType 错误'},
'RC990003' : {'code':990003, 'msg':'请求文件大小超限'},
'RC990004' : {'code':990004, 'msg':'通讯协议参数 data / data_type缺失'},
'RC990005' : {'code':990005, 'msg':'所指定的通讯协议版本无效'},
'RC990006' : {'code':990006, 'msg':'协议包解析错误'},
'RC990007' : {'code':990007, 'msg':'解析器无法定位模板视图'},
'RC990008' : {'code':990008, 'msg':'未知的请求 mime 类型'},

# API接口级固定响应码
'RC990501' : {'code':990501, 'msg':'请求参数无效(缺失，或为空，或不符合规则)（出错啦，请稍后再试）'},
'RC990502' : {'code':990502, 'msg':'请求token无效（您的账号在其他设备登录，请重新登录）'},
'RC990503' : {'code':990503, 'msg':'请求权限无效（出错啦，请稍后再试）'},
'RC990504' : {'code':990504, 'msg':'验证码错误（验证码错误，请重新输入验证码）'},
'RC990505' : {'code':990505, 'msg':'请求业务执行失败（出错啦，请稍后再试）'},
'RC990506' : {'code':990506, 'msg':'没有响应数据，即响应结果数据(result)不存在'},
'RC990507' : {'code':990507, 'msg':'请求已经过期'},
'RC990508' : {'code':990508, 'msg':'请求签名认证无效（登录失败，请重新登录）'},

# 用户认证系统(LUDS/01)
'RC9010000' : {'code':9010000, 'msg':'通用错误码'},
'RC9012000' : {'code':9012000, 'msg':'UserName已存在'},
'RC9012001' : {'code':9012001, 'msg':'邮件发送失败'},
'RC9012002' : {'code':9012002, 'msg':'邮件授权码错误'},
}